package io.github.vitalikulsha.telegrambot.util;

public enum ConstReply {
    HELLO("Цябе вітае QuizBot! Давай згуляем!"),
    START("Выберы з прапанаванага меню."),
    START_QUEST("Дык вось, пачнем! Адказам на заданне будзе лічыцца імя і прозвішча чалавека " +
            "на фота праз прабел. Адказы прымаюцца на рускай альбо беларускай мовах. "),
    HINT("Запусці Quiz, каб атрымаць падказкі."),
    HELP("Чат-бот прадастаўляе магчымасць прайсці захапляльны Quiz на тэму \"Беларусь: мы адзіны народ\". " +
            "Адказвай па парадку на пытанні чат-бота і правер свае веды. Ты заўсёды можаш звярнуцца за падказкай " +
            "да чат-боту, але толькі адзін раз. Дазаваляецца выкарыстоўваць замест 'і' - 'и', замест 'ў' - 'у'."+
            "Адказы можна даваць на беларускай альбо рускай мове, акрамя заданняў з 7 па 12."),
    COMMENT("Правільна! Ты малайчына! Вось наступнае заданне."),
    COMMENT_WIN("Правільна! Ты прайшоў усе заданні, значыць ты сапраўдны патрыёт сваёй краіны і многае ведаеш пра яе."),
    UNKNOWN("Гэтая каманда мне невядомая"),
    NO_RIGHT("Ня правільна! Падумай яшчэ!");

    String command;

    public String getCommand() {
        return command;
    }

    ConstReply(String command) {
        this.command = command;
    }
}
