package io.github.vitalikulsha.telegrambot.util;

public enum ConstReply {
    HELLO("Цябе вітае QuizBot! Давай згуляем! \n Больш інфарцыі можна даведацца націснуў кнопку \"Даведка\". " +
            "Цісні туды и пачынай гуляць."),
    START("Выберы з прапанаванага меню."),
    RESTART("Увесь вынік скінуты. Пачнем спачатку. Выберы з прапанаванага меню."),
    START_QUEST("Дык вось, пачнем! Адказам на заданне будзе лічыцца імя і прозвішча чалавека " +
            "на фота праз прабел. Адказы прымаюцца на рускай альбо беларускай мовах. "),
    HINT("Запусці Quiz, каб атрымаць падказкі."),
    HELP("Чат-бот прадастаўляе магчымасць прайсці захапляльны Quiz на тэму \"Беларусь: мы адзіны народ\". " +
            "Адказвай па парадку на пытанні чат-бота і правер свае веды. Ты заўсёды можаш звярнуцца за падказкай " +
            "да чат-боту, але толькі адзін раз. Дазаваляецца выкарыстоўваць замест 'і' - 'и', замест 'ў' - 'у'."+
            "Адказы можна даваць на беларускай альбо рускай мове, акрамя заданняў з 7 па 12. Прайдзі Quiz і даведайся " +
            "свой вынік. За адказы па-беларуску будзе налічвацца больш балаў, а за падказку - адымацца. Дзяліціся " +
            "вынікам са сваімі сябрамі. Поспеху!"),
    COMMENT("Правільна! Ты малайчына! Вось наступнае заданне."),
    COMMENT0("У наступных заданнях трэба напісаць тое, што паказана на фота на беларускі лад."),
    COMMENT1("А у гэтых заданнях трэба напісаць у якім горадзе знаходзіцца помнік на фота."),
    COMMENT_WIN("Ты прайшоў усе заданні, значыць ты сапраўдны патрыёт сваёй краіны і многае ведаеш " +
            "пра яе. Калі мы адзіныя, мы непераможныя!!! Твой вынік - "),
    UNKNOWN("Гэтая каманда мне невядомая"),
    NO_RIGHT("Ня правільна! Падумай яшчэ!");

    String command;

    public String getCommand() {
        return command;
    }

    ConstReply(String command) {
        this.command = command;
    }
}
