package io.github.vitalikulsha.telegrambot.util;

public enum MutableHint {
    HINT01("Канстанцін Міхайлавіч Міцкевіч, знакаміты беларускі пісьменнік, драматург, " +
            "паэт і перакладчык, грамадскі дзеяч. Народны паэт БССР. Аўтар такіх твораў, як \"Сымон-музыка\", " +
            "\"На ростанях\", \"Песнi жальбы\", \"Новая зямля\" і інш. У гонар яго названа плошчу ў Мінску."),
    HINT02("Іван Дамінікавіч Луцэвіч, знакаміты беларускі паэт і перакладчык, драматург, публіцыст. " +
            "Народны паэт БССР. Аўтар такіх твораў, як \"Жалейка\", \"Паўлiнка\", \"Раскiданае гняздо\", " +
            "\"Тутэйшыя\" і інш. У гонар яго названы тэатр у Мінску"),
    HINT03("Знакаміты беларускі першадрукар, філосаф-гуманіст, пісьменнік, грамадскі дзеяч, " +
            "прадпрымальнік і навуковец-медык. Першым пераклаў і выдаў Біблію на старабеларускай мове. " +
            "У гонар яго названы універсітэт у Гомелі, а таксама вуліца ў Жодзіна."),
    HINT04("Знакаміты мастак яўрэйскага паходжання. Адзін з самых вядомых прадстаўнікоў мастацкага авангарду" +
            " ХХ стагоддзя. У Віцебску ў яго гонар адкрыты дом-музей з яго працамі."),
    HINT05("Знакаміты Беларускі пісьменнік, грамадскі дзеяч, дэпутат Вярхоўнага Савета БССР, удзельнік ВАВ," +
            " член саюза пісьменнікаў СССР. Народны пісьменнік БССР. Аўтар такіх твораў, як \"Жураўліны крык\"," +
            " \"Альпійская балада\", \"Мёртвым не баліць\" і інш. Па яго творах былі знятыя фільмы " +
            "\"Альпійская балада\", \"Знак бяды\", \"Круглянскі мост\" і інш."),
    HINT06("Беларуская біятланістка, чатырохразовую алімпійская чэмпіёнка, двухразовая чэмпіёнка свету." +
            " Самая тытулаваная спартсменка ў гісторыі зімовых Алімпійскіх гульняў, а таксама першая ў свеце " +
            "біятланістка, якая атрымала тры перамогі ў асабістых гонках."),
    HINT07("Сковорода - Па....ня"),
    HINT08("Карандаш - Ал...к"),
    HINT09("Носки - Шк.....кі"),
    HINT10("Крыжовник - Аг...т"),
    HINT11("Лицо - Т..р"),
    HINT12("Ежевика - Аж..а"),
    HINT13("Горад, дзе вырабляюць БелАЗ."),
    HINT14("Паўночная сталіца Беларусі."),
    HINT15("Горад на Дняпры."),
    HINT16("Сталіца Беларусі."),
    HINT17("Горад на Бугу."),
    HINT18("У гэтым раёне знаходзіцца вёска Александрыя, у якой вучыўся першы прэзідэнт Беларусі.");

    String command;

    public String getCommand() {
        return command;
    }

    MutableHint(String command) {
        this.command = command;
    }
}
